<?xml version="1.0"?>
<net name="Model6" version="11">
	<layers>
		<layer id="34" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="decoder_input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Parameter_37438" type="Parameter" version="opset1">
			<data shape="?,?,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Parameter_37450" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Parameter_37449" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Parameter_37448" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Parameter_37447" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Parameter_37454" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Parameter_37453" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Parameter_37452" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Parameter_37451" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Parameter_37458" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Parameter_37457" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Parameter_37456" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Parameter_37455" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Parameter_37462" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Parameter_37461" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Parameter_37460" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Parameter_37459" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Parameter_37466" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Parameter_37465" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Parameter_37464" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Parameter_37463" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Parameter_37470" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Parameter_37469" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Parameter_37468" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Parameter_37467" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Parameter_37474" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Parameter_37473" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Parameter_37472" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Parameter_37471" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Parameter_37478" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Parameter_37477" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Parameter_37476" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.encoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="Parameter_37475" type="Parameter" version="opset1">
			<data shape="?,6,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.encoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_51711" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="0" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="self.model.shared.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50364, 512" offset="2048" size="103145472" />
			<output>
				<port id="0" precision="FP32" names="self.model.shared.weight">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.decoder/prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.decoder/aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="76" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103147528" size="8" />
			<output>
				<port id="0" precision="I64" names="76" />
			</output>
		</layer>
		<layer id="40" name="__module.model.decoder/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="__module.model.decoder/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="125" />
			</output>
		</layer>
		<layer id="42" name="Constant_61741" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.decoder/prim::ListConstruct/Reshape_0" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.decoder/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="127">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.decoder/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="128">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.decoder.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.decoder.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="48" name="__module.model.decoder.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="129,186,196,hidden_states.3,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_51587" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="103147540" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_51586" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_51584" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149592" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="187">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_28385" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64" names="188">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="189,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_51585" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149596" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="190">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="193,195,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="self.model.decoder.block.0.layer.0.SelfAttention.q.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="103149600" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.q.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211,states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_49940" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936032" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="66" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="202">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936040" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="212,217,224">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="103936056" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="self.model.decoder.block.0.layer.0.SelfAttention.k.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="103936072" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.k.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.decoder.block.0.layer.0.SelfAttention.k/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="216,states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="218">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="103936056" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="230_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="self.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 6" offset="104722504" size="768" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>32</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="82" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="83" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="203,258" />
			</output>
		</layer>
		<layer id="84" name="__module.model.decoder/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="79" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="104723272" size="8" />
			<output>
				<port id="0" precision="I64" names="79" />
			</output>
		</layer>
		<layer id="86" name="__module.model.decoder/aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="87" name="__module.model.decoder/aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="130,205" />
			</output>
		</layer>
		<layer id="88" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="204,seq_length.3" />
			</output>
		</layer>
		<layer id="89" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="104723280" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="231,232,234">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="75" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103936032" size="8" />
			<output>
				<port id="0" precision="I64" names="75" />
			</output>
		</layer>
		<layer id="92" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="235,236,memory_position">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="233,context_position">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="237">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="96" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="238">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::min/Minimum" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="239">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_51588" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="240,relative_position">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_51589" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723284" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="241">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="242">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_51590" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723292" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="243">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::log/Log" type="Log" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="244">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_51591" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723296" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::div/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="245">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_51592" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723292" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="246">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="247">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_51593" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723284" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="248">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_51594" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723300" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::min/Minimum_1" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="250">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="251,252">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="120" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="254,values">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_28688" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="104723308" size="24" />
			<output>
				<port id="0" precision="I64" names="255">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="256">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="257,262,263,position_bias.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_50021" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="104723332" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_50020" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104723272" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::neg/ConvertLike_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="127" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="260,261" />
			</output>
		</layer>
		<layer id="128" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::slice/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="129" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::slice/Unsqueeze_16" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_50019" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="ScatterUpdate_50022" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Constant_50025" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="104723356" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_50028" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="104723380" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::slice/Slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="264,265,position_bias.3">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Constant_51595" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="__module.model.decoder/aten::ones/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
