<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="decoder_input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="Parameter_18492" type="Parameter" version="opset1">
			<data shape="?,?,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.model.decoder.block.7.layer.1.EncDecAttention.v.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="0" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.7.layer.1.EncDecAttention.v.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.model.decoder.block.7.layer.1.EncDecAttention.v/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1413,states.125">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_26505" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="786432" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self.model.shared.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50364, 512" offset="788480" size="103145472" />
			<output>
				<port id="0" precision="FP32" names="self.model.shared.weight">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.model.decoder/prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103933952" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.model.decoder/aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="51" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103933960" size="8" />
			<output>
				<port id="0" precision="I64" names="51" />
			</output>
		</layer>
		<layer id="10" name="__module.model.decoder/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="11" name="__module.model.decoder/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="100" />
			</output>
		</layer>
		<layer id="12" name="Constant_60958" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103933952" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.decoder/prim::ListConstruct/Reshape_0" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.decoder/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="101">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.decoder/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="102">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.decoder.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model.decoder.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="18" name="__module.model.decoder.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="103,146,156,hidden_states.3,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_26377" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="103933972" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_26376" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103936020" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_26374" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103936024" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="147">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_10370" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103933952" size="8" />
			<output>
				<port id="0" precision="I64" names="148">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="149,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_26375" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103936028" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="150">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="151">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="152,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="153,155,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="self.model.decoder.block.0.layer.0.SelfAttention.q.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="103936032" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.q.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="165,states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_25365" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104722464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="36" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="162">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104722472" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104722480" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.decoder.block.0.layer.0.SelfAttention/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="166,171,176">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="167">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="104722488" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="168">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.model.decoder.block.0.layer.0.SelfAttention.k.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="104722504" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.k.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.decoder.block.0.layer.0.SelfAttention.k/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170,states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="172">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="104722488" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.key">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="180_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="self.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 6" offset="105508936" size="768" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>32</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="51" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="52" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="163" />
			</output>
		</layer>
		<layer id="53" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="105509704" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="54" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::arange/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="181,182,184">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="50" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="104722464" size="8" />
			<output>
				<port id="0" precision="I64" names="50" />
			</output>
		</layer>
		<layer id="56" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="185,186,memory_position">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="183,context_position">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="187">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::zeros_like/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="188">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::min/Minimum" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="189">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_26378" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="103933952" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="190,relative_position">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_26379" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="105509708" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="191">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="192">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_26380" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="105509716" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="193">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::log/Log" type="Log" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="194">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_26381" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="105509720" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::div/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="195">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_26382" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="105509716" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="196">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="197">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_26383" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="105509708" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="198">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_26384" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="105509724" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::min/Minimum_1" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="200">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="201,202">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="84" name="__module.model.decoder.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="204,values">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_10648" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="105509732" size="24" />
			<output>
				<port id="0" precision="I64" names="205">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="207,position_bias.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_26385" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="103936020" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.decoder/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="__module.model.decoder/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="105509704" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="91" name="__module.model.decoder/aten::arange/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.decoder/aten::arange/ConvertLike" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="106,seq_ids">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.decoder/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="107,112,113">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.decoder/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="108,109">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_25368" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="104722464" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.decoder/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103933968" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="97" name="__module.model.decoder/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="99">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.decoder/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103933960" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.decoder/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="110">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.decoder/aten::repeat/Tile" type="Tile" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="111">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="56" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="105509756" size="8" />
			<output>
				<port id="0" precision="I64" names="56" />
			</output>
		</layer>
		<layer id="102" name="__module.model.decoder/aten::unsqueeze/Unsqueeze_3" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="114">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.decoder/aten::le/LessEqual" type="LessEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="115,causal_mask.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.decoder/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="116,117,causal_mask">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.decoder/aten::unsqueeze/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="118,119,120">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.decoder/aten::ones/Constant" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="103936020" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="107" name="__module.model.decoder/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="104">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.decoder/aten::ones/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="105,121,attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.decoder/aten::unsqueeze/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="122">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.decoder/aten::unsqueeze/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="123,124">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.decoder/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="125,126,extended_attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.decoder/aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="127">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_26386" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="105509764" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.decoder/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="128,mask.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208,224,231,335,position_bias.3">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="180,210,input.3,scores.1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="211,212,input.5">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.model.decoder.block.0.layer.0.SelfAttention.v.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="105509768" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.model.decoder.block.0.layer.0.SelfAttention.v.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.decoder.block.0.layer.0.SelfAttention.v/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175,states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="177">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_3" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="104722488" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.decoder.value">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="214,states.7">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_4" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="104722488" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
