<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_9293" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="0" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50364, 512" offset="2048" size="103145472" />
			<output>
				<port id="0" precision="FP32" names="self.embed_tokens.weight">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="22" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103147528" size="8" />
			<output>
				<port id="0" precision="I64" names="22" />
			</output>
		</layer>
		<layer id="7" name="aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="8" name="aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="23,25" />
			</output>
		</layer>
		<layer id="9" name="Constant_60713" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="prim::ListConstruct/Reshape_0" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="27">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="28">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="15" name="__module.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50364</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="110,120,71,hidden_states.3,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_9186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="103147540" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_9185" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_9183" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149592" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.block.0.layer.0.layer_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="111">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_142" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64" names="112">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.block.0.layer.0.layer_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_9184" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149596" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.block.0.layer.0.layer_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="114">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.block.0.layer.0.layer_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.block.0.layer.0.layer_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="115">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.block.0.layer.0.layer_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="116,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.block.0.layer.0.layer_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="117,119,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="self.block.0.layer.0.SelfAttention.q.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="103149600" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.block.0.layer.0.SelfAttention.q.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.block.0.layer.0.SelfAttention.q/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="129,states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.block.0.layer.0.SelfAttention/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_8615" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936032" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.block.0.layer.0.SelfAttention/aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="33" name="__module.block.0.layer.0.SelfAttention/aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="126">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_0" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936040" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103936048" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="130,135,140">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.block.0.layer.0.SelfAttention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="131">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="103936056" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.block.0.layer.0.SelfAttention/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="132">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="self.block.0.layer.0.SelfAttention.k.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="103936072" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.block.0.layer.0.SelfAttention.k.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.block.0.layer.0.SelfAttention.k/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="134,states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.block.0.layer.0.SelfAttention/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="136">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_8686" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="104722504" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.block.0.layer.0.SelfAttention/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.block.0.layer.0.SelfAttention/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="144_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.block.0.layer.0.SelfAttention.relative_attention_bias.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 6" offset="104722520" size="768" />
			<output>
				<port id="0" precision="FP32" names="self.block.0.layer.0.SelfAttention.relative_attention_bias.weight">
					<dim>32</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.block.0.layer.0.SelfAttention/aten::arange/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="49" name="80" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103147528" size="8" />
			<output>
				<port id="0" precision="I64" names="80" />
			</output>
		</layer>
		<layer id="50" name="__module.block.0.layer.0.SelfAttention/aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="51" name="__module.block.0.layer.0.SelfAttention/aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="127" />
			</output>
		</layer>
		<layer id="52" name="__module.block.0.layer.0.SelfAttention/aten::arange/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="104723288" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="53" name="__module.block.0.layer.0.SelfAttention/aten::arange/Range_1" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="145,146,148">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="101" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103936032" size="8" />
			<output>
				<port id="0" precision="I64" names="101" />
			</output>
		</layer>
		<layer id="55" name="__module.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="149,150,memory_position">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="147,context_position">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.block.0.layer.0.SelfAttention/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="151,relative_position.1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_9187" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="103936032" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.block.0.layer.0.SelfAttention/aten::gt/Greater" type="Greater" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="152">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.block.0.layer.0.SelfAttention/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="153">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_9188" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723292" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.block.0.layer.0.SelfAttention/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="154,155_1">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.block.0.layer.0.SelfAttention/aten::abs/Abs" type="Abs" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="156,relative_position">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_9189" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723300" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.block.0.layer.0.SelfAttention/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="157">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.block.0.layer.0.SelfAttention/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="158">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_9190" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723308" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.block.0.layer.0.SelfAttention/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="159">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.block.0.layer.0.SelfAttention/aten::log/Log" type="Log" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="160">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_9191" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723312" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.block.0.layer.0.SelfAttention/aten::div/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_9192" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1" offset="104723308" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.block.0.layer.0.SelfAttention/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="162">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.block.0.layer.0.SelfAttention/aten::to/Convert_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="163">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_9193" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723300" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.block.0.layer.0.SelfAttention/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="164">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_9194" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1" offset="104723316" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.block.0.layer.0.SelfAttention/aten::min/Minimum" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="166">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.block.0.layer.0.SelfAttention/aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="167">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.block.0.layer.0.SelfAttention/aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="155,relative_buckets">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="103147536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="83" name="__module.block.0.layer.0.SelfAttention.relative_attention_bias/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="170,values">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_420" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="104723324" size="24" />
			<output>
				<port id="0" precision="I64" names="171">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.block.0.layer.0.SelfAttention/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="172">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="__module.block.0.layer.0.SelfAttention/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="173,position_bias.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_9196" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="35" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="103147528" size="8" />
			<output>
				<port id="0" precision="I64" names="35" />
			</output>
		</layer>
		<layer id="89" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="36">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="37" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="104723348" size="8" />
			<output>
				<port id="0" precision="I64" names="37" />
			</output>
		</layer>
		<layer id="91" name="aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="38,43,extended_attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="48">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_9195" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="aten::rsub/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="51">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_9197" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="104723356" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="53,mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.block.0.layer.0.SelfAttention/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="174,189,194,57,position_bias">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.block.0.layer.0.SelfAttention/aten::add_/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="144,176,input.3,scores.1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.block.0.layer.0.SelfAttention/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="177,178,input.5">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.block.0.layer.0.SelfAttention.v.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 512" offset="104723360" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.block.0.layer.0.SelfAttention.v.weight">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.block.0.layer.0.SelfAttention.v/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="139,states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.block.0.layer.0.SelfAttention/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="141">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_3" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="103936056" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.block.0.layer.0.SelfAttention/aten::transpose/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="142">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.block.0.layer.0.SelfAttention/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="180,states.7">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate_4" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="103936056" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.block.0.layer.0.SelfAttention/aten::transpose/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Reshape_1_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="105509792" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.block.0.layer.0.SelfAttention/prim::ListConstruct/Concat_3" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="183">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.block.0.layer.0.SelfAttention/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="184">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="self.block.0.layer.0.SelfAttention.o.weight" type="Const" version="opset1">
			<data element_type="f32" shape="512, 384" offset="105509800" size="786432" />
			<output>
				<port id="0" precision="FP32" names="self.block.0.layer.0.SelfAttention.o.weight">
					<dim>512</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.block.0.layer.0.SelfAttention.o/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="186,188,input.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.block.0.layer.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191,193,199,209,hidden_states.11,hidden_states.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_9201" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="106296232" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_9200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149588" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_9198" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149592" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.block.0.layer.1.layer_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_495" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="103147520" size="8" />
			<output>
				<port id="0" precision="I64" names="201">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.block.0.layer.1.layer_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="202,variance.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_9199" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="103149596" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.block.0.layer.1.layer_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="203">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.block.0.layer.1.layer_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.block.0.layer.1.layer_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.block.0.layer.1.layer_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205,hidden_states.13">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.block.0.layer.1.layer_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206,208">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_9080" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 512" offset="106298280" size="2097152" />
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
